OpenNuvoton/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
/*
 * *** THIS FILE HAS BEEN MACHINE GENERATED ***
 *
 * This file has been machine generated using the script:
 * generate_test_code.py
 *
 * Test file      : ./test_suite_hkdf.c
 *
 * The following files were used to create this file.
 *
 *      Main code file      : suites/main_test.function
 *      Platform code file  : suites/host_test.function
 *      Helper file         : suites/helpers.function
 *      Test suite file     : suites/test_suite_hkdf.function
 *      Test suite data     : suites/test_suite_hkdf.data
 *
 */

#if defined(__unix__) || (defined(__APPLE__) && defined(__MACH__))
    #if !defined(_POSIX_C_SOURCE)
        #define _POSIX_C_SOURCE 200112L // for fileno() from <stdio.h>
    #endif
#endif

#include "mbedtls/build_info.h"

/* Test code may use deprecated identifiers only if the preprocessor symbol
 * MBEDTLS_TEST_DEPRECATED is defined. When building tests, set
 * MBEDTLS_TEST_DEPRECATED explicitly if MBEDTLS_DEPRECATED_WARNING is
 * enabled but the corresponding warnings are not treated as errors.
 */
#if !defined(MBEDTLS_DEPRECATED_REMOVED) && !defined(MBEDTLS_DEPRECATED_WARNING)
    #define MBEDTLS_TEST_DEPRECATED
#endif

/*----------------------------------------------------------------------------*/
/* Common helper code */

/*----------------------------------------------------------------------------*/
/* Headers */
#include <test/helpers.h>
#include <test/macros.h>
#include <test/random.h>
//#include <test/bignum_helpers.h>
//#include <test/arguments.h>

#include <test/psa_crypto_helpers.h>

#include <stdlib.h>

#include "NuMicro.h"
#if defined(MBEDTLS_ERROR_C)
    #include "mbedtls/error.h"
#endif
//Porting by nvt
#if defined(MBEDTLS_PLATFORM_C)
    #include "mbedtls/platform.h"
#else
    #include <stdio.h>
    #define mbedtls_fprintf    fprintf
    #define mbedtls_snprintf   snprintf
    #define mbedtls_calloc     calloc
    #define mbedtls_free       free
    #define mbedtls_exit       exit
    #define mbedtls_time       time
    #define mbedtls_time_t     time_t
    #define MBEDTLS_EXIT_SUCCESS EXIT_SUCCESS
    #define MBEDTLS_EXIT_FAILURE EXIT_FAILURE
#endif
//End Porting by nvt
#if defined(MBEDTLS_MEMORY_BUFFER_ALLOC_C)
    #include "mbedtls/memory_buffer_alloc.h"
#endif

//Porting by nvt
#ifdef _MSC_VER
    #include <basetsd.h>
    typedef UINT8 uint8_t;
    typedef INT32 int32_t;
    typedef UINT32 uint32_t;
    #define strncasecmp _strnicmp
    #define strcasecmp _stricmp
#else
    #include <stdint.h>
#endif
//End Porting by nvt
#include <string.h>

#if defined(__unix__) || (defined(__APPLE__) && defined(__MACH__))
    #include <unistd.h>
    #include <strings.h>
#endif

//Porting by nvt
/* Type for Hex parameters */
typedef struct data_tag
{
    uint8_t    *x;
    uint32_t    len;
} data_t;
//End Porting by nvt
#if defined(MBEDTLS_MD_SOME_PSA)
    #define MD_PSA_INIT()   PSA_INIT()
    #define MD_PSA_DONE()   PSA_DONE()
#else /* MBEDTLS_MD_SOME_PSA */
    #define MD_PSA_INIT() ((void) 0)
    #define MD_PSA_DONE() ((void) 0)
#endif /* MBEDTLS_MD_SOME_PSA */

/** Allocate memory dynamically and fail the test case if this fails.
 * The allocated memory will be filled with zeros.
 *
 * You must set \p pointer to \c NULL before calling this macro and
 * put `mbedtls_free(pointer)` in the test's cleanup code.
 *
 * If \p item_count is zero, the resulting \p pointer will be \c NULL.
 * This is usually what we want in tests since API functions are
 * supposed to accept null pointers when a buffer size is zero.
 *
 * This macro expands to an instruction, not an expression.
 * It may jump to the \c exit label.
 *
 * \param pointer    An lvalue where the address of the allocated buffer
 *                   will be stored.
 *                   This expression may be evaluated multiple times.
 * \param item_count Number of elements to allocate.
 *                   This expression may be evaluated multiple times.
 *
 */
#define TEST_CALLOC(pointer, item_count)                    \
    do {                                                    \
        TEST_ASSERT((pointer) == NULL);                     \
        if ((item_count) != 0) {                            \
            (pointer) = mbedtls_calloc(sizeof(*(pointer)),  \
                                       (item_count));       \
            TEST_ASSERT((pointer) != NULL);                 \
        }                                                   \
    } while (0)

/** Compare two buffers and fail the test case if they differ.
*
* This macro expands to an instruction, not an expression.
* It may jump to the \c exit label.
*
* \param p1        Pointer to the start of the first buffer.
* \param size1     Size of the first buffer in bytes.
*                  This expression may be evaluated multiple times.
* \param p2        Pointer to the start of the second buffer.
* \param size2     Size of the second buffer in bytes.
*                  This expression may be evaluated multiple times.
*/
#define TEST_MEMORY_COMPARE(p1, size1, p2, size2)              \
    do {                                                       \
        TEST_EQUAL((size1), (size2));                          \
        if ((size1) != 0) {                                    \
            TEST_ASSERT(memcmp((p1), (p2), (size1)) == 0);     \
        }                                                      \
    } while (0)


typedef union
{
    size_t len;
    intmax_t sint;
} mbedtls_test_argument_t;


/*----------------------------------------------------------------------------*/
/* Status and error constants */

#define DEPENDENCY_SUPPORTED            0   /* Dependency supported by build */
#define KEY_VALUE_MAPPING_FOUND         0   /* Integer expression found */
#define DISPATCH_TEST_SUCCESS           0   /* Test dispatch successful */

#define KEY_VALUE_MAPPING_NOT_FOUND     -1  /* Integer expression not found */
#define DEPENDENCY_NOT_SUPPORTED        -2  /* Dependency not supported */
#define DISPATCH_TEST_FN_NOT_FOUND      -3  /* Test function not found */
#define DISPATCH_INVALID_TEST_DATA      -4  /* Invalid test parameter type.
                                               Only int, string, binary data
                                               and integer expressions are
                                               allowed */
#define DISPATCH_UNSUPPORTED_SUITE      -5  /* Test suite not supported by the
                                               build */

