OpenNuvoton/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
/*----------------------------------------------------------------------------*/
/* Global variables */

/*----------------------------------------------------------------------------*/
/* Helper flags for complex dependencies */

/* Indicates whether we expect mbedtls_entropy_init
 * to initialize some strong entropy source. */
#if !defined(MBEDTLS_NO_DEFAULT_ENTROPY_SOURCES) && \
    (!defined(MBEDTLS_NO_PLATFORM_ENTROPY) ||      \
    defined(MBEDTLS_ENTROPY_HARDWARE_ALT) ||    \
    defined(ENTROPY_NV_SEED))
#define ENTROPY_HAVE_STRONG
#endif


/*----------------------------------------------------------------------------*/
/* Helper Functions */

#if defined(__unix__) || (defined(__APPLE__) && defined(__MACH__))
static int redirect_output(FILE *out_stream, const char *path)
{
    int out_fd, dup_fd;
    FILE *path_stream;

    out_fd = fileno(out_stream);
    dup_fd = dup(out_fd);

    if (dup_fd == -1)
    {
        return -1;
    }

    path_stream = fopen(path, "w");

    if (path_stream == NULL)
    {
        close(dup_fd);
        return -1;
    }

    fflush(out_stream);

    if (dup2(fileno(path_stream), out_fd) == -1)
    {
        close(dup_fd);
        fclose(path_stream);
        return -1;
    }

    fclose(path_stream);
    return dup_fd;
}

static int restore_output(FILE *out_stream, int dup_fd)
{
    int out_fd = fileno(out_stream);

    fflush(out_stream);

    if (dup2(dup_fd, out_fd) == -1)
    {
        close(out_fd);
        close(dup_fd);
        return -1;
    }

    close(dup_fd);
    return 0;
}
#endif /* __unix__ || __APPLE__ __MACH__ */


/*----------------------------------------------------------------------------*/
/* test patterns */
#include "dat.h"

typedef struct
{
    const char *base;
    const char *limit;
    unsigned int ofs;
} MYFILE;

MYFILE g_myfile;

char *myfgets(char *s, int n, FILE *f)
{
    MYFILE *myfile;
    int32_t i;
    int32_t ofs;
    const char *pu8Base, *pu8Limit;

    myfile = (MYFILE *)f;

    pu8Base = myfile->base;
    pu8Limit = myfile->limit;
    ofs = myfile->ofs;

    /* End of file check */
    if (pu8Base + ofs >= pu8Limit)
        return 0;

    /* Seek to offset */
    pu8Base += ofs;

    /* Check length to read */
    if (pu8Base + n > pu8Limit)
    {
        /* touch the eof */
        n = (int)(pu8Limit - pu8Base);
    }

    for (i = 0; i < n; i++)
    {
        s[i] = pu8Base[i];

        /* Check new line */
        if ((pu8Base[i] == 0x0d) && (pu8Base[i + 1] == 0x0a))
        {
            s[i] = 0x0a;
            i++;

            /* ahead one byte due to CRLF --> LF */
            myfile->ofs += 1;
            break;
        }

        if (pu8Base[i] == 0x0a)
        {
            i++;
            break;
        }
    }

    /* update file offset */
    myfile->ofs += i;

    /* append 0 */
    if (i < n)
        s[i] = 0;

    return s;
}

int myfeof(FILE *f)
{
    MYFILE *myfile;
    myfile = (MYFILE *)f;

    if (myfile->base + myfile->ofs >= myfile->limit)
        return 1;

    return 0;
}

void myfclose(FILE *f)
{
    MYFILE *myfile;

    myfile = (MYFILE *)f;

    myfile->ofs = 0;
}

FILE *myfopen(char const *fname, char const *mode)
{
    g_myfile.base = _dat;
    g_myfile.limit = _dat + sizeof(_dat);
    g_myfile.ofs = 0;
    return (FILE *)&g_myfile;
}


/*----------------------------------------------------------------------------*/
/* Test Suite Code */


#define TEST_SUITE_ACTIVE

#if defined(MBEDTLS_HKDF_C)
#include "mbedtls/hkdf.h"
#include "md_wrap.h"
void dump_data(char *chptr, uint16_t len)
{
    for (int n = 0; n < len; n++)
        printf("0x%02x,", chptr[n]);

    printf("\r\n");
}

void dump_tlsdata(data_t *dd)
{
    int ii;

    for (ii = 0; ii < dd->len; ii++)
        printf("%02x", dd->x[ii]);

    printf("\r\n\r\n");
}



void test_test_hkdf(int md_alg, data_t *ikm, data_t *salt, data_t *info,
                    data_t *expected_okm)
{
    int ret;
    unsigned char okm[128] = { '\0' };

    MD_PSA_INIT();

    const mbedtls_md_info_t *md = mbedtls_md_info_from_type(md_alg);
    TEST_ASSERT(md != NULL);

    TEST_ASSERT(expected_okm->len <= sizeof(okm));

    ret = mbedtls_hkdf(md, salt->x, salt->len, ikm->x, ikm->len,
                       info->x, info->len, okm, expected_okm->len);

    TEST_ASSERT(ret == 0);

    TEST_MEMORY_COMPARE(okm, expected_okm->len,
                        expected_okm->x, expected_okm->len);

exit:
    MD_PSA_DONE();
}

void Byte2Reg_Order(char byteInput[], uint32_t volatile u32Reg[], uint16_t u16inputlen)
{
    char      hex;
    int       si, ri;
    uint32_t  i, val32;

    si = 0;
    ri = 0;

    while (si < u16inputlen)
    {
        val32 = 0UL;

        for (i = 0UL; (i < 4UL) && (si < u16inputlen); i++)
        {
            hex = byteInput[si];
            val32 |= (uint32_t)hex << ((3 - i) * 8UL);
            //printf("hex: 0x%02X, shitf:%d\n", hex, (4 - i) * 8UL);
            si++;
        }

        u32Reg[ri++] = val32;
        //printf("val32: 0x%08X\n", val32);
    }
}

void DumpKey(uint32_t *pu32KeyBuf, uint32_t u32WordCnt)
{
    int32_t i;

    printf("Derived key: ");

    for (i = 0; i < u32WordCnt; i++)
        printf("%08X", pu32KeyBuf[i]);

    printf("\n");
}

void dump_tlsokm(data_t *e_okm, unsigned char *ucpokm)
{
    int ii;

    //printf("e_okm->len=%d\r\n",e_okm->len);
    for (ii = 0; ii < e_okm->len; ii++)
        printf("%02x", ucpokm[ii]);

    printf("\r\n\r\n");
}


void test_test_hkdf_sha256(data_t *ikm, data_t *salt, data_t *info,
                           data_t *expected_okm)
{
    int ret;
    int32_t i32RetCode = 0;
    uint32_t g_au32Keyout[16]  = { 0 };
    size_t mylen;
    unsigned char okm[128] = { '\0' };
    unsigned char okm_rev[128] = { '\0' };
    MD_PSA_INIT();

    const mbedtls_md_info_t *md = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);//0x04 for SHA256
    TEST_ASSERT(md != NULL);

    TEST_ASSERT(expected_okm->len <= sizeof(okm));

    /*
      Since the ikm, salt, info and expected_okm are feed without testsuit,
      unhexify the char to meet mbedtls format.(with many type casting to avoid warning)
    */
    //#define DBG_TEST_TEST_HKDF_SHA256
    //#define DBG_TEST_TEST_HKDF_SHA256_RESULT

    /*KeyIn*/
    mbedtls_test_unhexify((unsigned char *) ikm->x, (strlen((const char *)(ikm->x))), (const char *)ikm->x, &mylen);
#ifdef DBG_TEST_TEST_HKDF_SHA256
    printf("au8KeyIn mylen=%d\r\n", mylen);
    dump_data((char *)ikm->x, mylen);
#endif

    /*Salt*/
    mbedtls_test_unhexify((unsigned char *) salt->x, (strlen((const char *)(salt->x))), (const char *)salt->x, &mylen) ;
#ifdef DBG_TEST_TEST_HKDF_SHA256
    printf("au8Salt mylen=%d\r\n", mylen);
    dump_data((char *)salt->x, mylen);
#endif

    /*Info*/
    mbedtls_test_unhexify((unsigned char *) info->x, (strlen((const char *)(info->x))), (const char *)info->x, &mylen) ;
#ifdef DBG_TEST_TEST_HKDF_SHA256
    printf("au8Info mylen=%d\r\n", mylen);
    dump_data((char *)info->x, mylen);
#endif

