OpenNuvoton/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
    /*Expected okm*/
    mbedtls_test_unhexify((unsigned char *) expected_okm->x, (strlen((const char *)(expected_okm->x))), (const char *)expected_okm->x, &mylen) ;
#ifdef DBG_TEST_TEST_HKDF_SHA256
    printf("expected_okm mylen=%d\r\n", mylen);
    dump_data((char *)expected_okm->x, mylen);
#endif

#ifdef DBG_TEST_TEST_HKDF_SHA256/*To make sure the input are in right format*/
    printf("salt:");
    dump_tlsdata(salt);
    printf("ikm:");
    dump_tlsdata(ikm);
    printf("info:");
    dump_tlsdata(info);
    printf("expected_okm:");
    dump_tlsdata(expected_okm);
#endif

    ret = mbedtls_hkdf(md, salt->x, salt->len, ikm->x, ikm->len,
                       info->x, info->len, okm, expected_okm->len);

#ifdef DBG_TEST_TEST_HKDF_SHA256_RESULT
    printf("\r\nokm \r\n");
    dump_data((char *)okm, mylen);
#endif
    Byte2Reg_Order((char *)okm, (uint32_t *)okm_rev, mylen);

#ifdef DBG_TEST_TEST_HKDF_SHA256_RESULT
    printf("\r\nokm_rev \r\n");
    dump_data((char *)okm_rev, mylen);

    DumpKey((uint32_t *)okm, 256 / 32); /* Word based dump, byteCnt = 256/32 = key bits/word bits */
#endif

#ifdef DBG_TEST_TEST_HKDF_SHA256
    printf("\r\ndump expected_okm:\r\n");
    dump_tlsokm(expected_okm, okm);
#endif


#ifdef NVT_HKDF_ALT
    ret = memcmp(okm_rev, expected_okm->x, expected_okm->len);/*expected_okm->len = 32 byte, Byte based memcmp*/
#else
    ret = memcmp(okm, expected_okm->x, expected_okm->len);/*expected_okm->len = 32 byte, Byte based memcmp*/
#endif

    if (ret)
        printf("\r\nTest Fail: ret=%d\r\n", ret);
    else
        printf("\r\nTest Pass\r\n");

exit:
    MD_PSA_DONE();
}

void test_test_hkdf_wrapper(void **params)
{
    data_t data1 = {(uint8_t *) params[1], ((mbedtls_test_argument_t *) params[2])->len};
    data_t data3 = {(uint8_t *) params[3], ((mbedtls_test_argument_t *) params[4])->len};
    data_t data5 = {(uint8_t *) params[5], ((mbedtls_test_argument_t *) params[6])->len};
    data_t data7 = {(uint8_t *) params[7], ((mbedtls_test_argument_t *) params[8])->len};

    test_test_hkdf(((mbedtls_test_argument_t *) params[0])->sint, &data1, &data3, &data5, &data7);
}

void test_test_hkdf_extract(int md_alg,
                            data_t *ikm,
                            data_t *salt,
                            data_t *prk)
{
    int ret;
    unsigned char *output_prk = NULL;
    size_t output_prk_len;

    MD_PSA_INIT();

    const mbedtls_md_info_t *md = mbedtls_md_info_from_type(md_alg);
    TEST_ASSERT(md != NULL);

    output_prk_len = mbedtls_md_get_size(md);
    TEST_CALLOC(output_prk, output_prk_len);

    ret = mbedtls_hkdf_extract(md, salt->x, salt->len,
                               ikm->x, ikm->len, output_prk);
    TEST_ASSERT(ret == 0);

    TEST_MEMORY_COMPARE(output_prk, output_prk_len, prk->x, prk->len);

exit:
    mbedtls_free(output_prk);
    MD_PSA_DONE();
}

void test_test_hkdf_extract_wrapper(void **params)
{
    data_t data1 = {(uint8_t *) params[1], ((mbedtls_test_argument_t *) params[2])->len};
    data_t data3 = {(uint8_t *) params[3], ((mbedtls_test_argument_t *) params[4])->len};
    data_t data5 = {(uint8_t *) params[5], ((mbedtls_test_argument_t *) params[6])->len};

    test_test_hkdf_extract(((mbedtls_test_argument_t *) params[0])->sint, &data1, &data3, &data5);
}

void test_test_hkdf_expand(int md_alg,
                           data_t *info,
                           data_t *prk,
                           data_t *okm)
{
    enum { OKM_LEN  = 1024 };
    int ret;
    unsigned char *output_okm = NULL;

    MD_PSA_INIT();

    const mbedtls_md_info_t *md = mbedtls_md_info_from_type(md_alg);
    TEST_ASSERT(md != NULL);

    TEST_CALLOC(output_okm, OKM_LEN);

    TEST_ASSERT(prk->len == mbedtls_md_get_size(md));
    TEST_ASSERT(okm->len < OKM_LEN);

    ret = mbedtls_hkdf_expand(md, prk->x, prk->len,
                              info->x, info->len,
                              output_okm, OKM_LEN);
    TEST_ASSERT(ret == 0);
    TEST_MEMORY_COMPARE(output_okm, okm->len, okm->x, okm->len);

exit:
    mbedtls_free(output_okm);
    MD_PSA_DONE();
}

void test_test_hkdf_expand_wrapper(void **params)
{
    data_t data1 = {(uint8_t *) params[1], ((mbedtls_test_argument_t *) params[2])->len};
    data_t data3 = {(uint8_t *) params[3], ((mbedtls_test_argument_t *) params[4])->len};
    data_t data5 = {(uint8_t *) params[5], ((mbedtls_test_argument_t *) params[6])->len};

    test_test_hkdf_expand(((mbedtls_test_argument_t *) params[0])->sint, &data1, &data3, &data5);
}

void test_test_hkdf_extract_ret(int hash_len, int ret)
{
    int output_ret;
    unsigned char *salt = NULL;
    unsigned char *ikm = NULL;
    unsigned char *prk = NULL;
    size_t salt_len, ikm_len;
    struct mbedtls_md_info_t fake_md_info;

    memset(&fake_md_info, 0, sizeof(fake_md_info));
    fake_md_info.type = MBEDTLS_MD_NONE;
    fake_md_info.size = hash_len;

    TEST_CALLOC(prk, MBEDTLS_MD_MAX_SIZE);
    salt_len = 0;
    ikm_len = 0;

    output_ret = mbedtls_hkdf_extract(&fake_md_info, salt, salt_len,
                                      ikm, ikm_len, prk);
    TEST_ASSERT(output_ret == ret);

exit:
    mbedtls_free(prk);
}

void test_test_hkdf_extract_ret_wrapper(void **params)
{

    test_test_hkdf_extract_ret(((mbedtls_test_argument_t *) params[0])->sint, ((mbedtls_test_argument_t *) params[1])->sint);
}

void test_test_hkdf_expand_ret(int hash_len, int prk_len, int okm_len, int ret)
{
    int output_ret;
    unsigned char *info = NULL;
    unsigned char *prk = NULL;
    unsigned char *okm = NULL;
    size_t info_len;
    struct mbedtls_md_info_t fake_md_info;

    memset(&fake_md_info, 0, sizeof(fake_md_info));
    fake_md_info.type = MBEDTLS_MD_NONE;
    fake_md_info.size = hash_len;

    info_len = 0;

    if (prk_len > 0)
    {
        TEST_CALLOC(prk, prk_len);
    }

    if (okm_len > 0)
    {
        TEST_CALLOC(okm, okm_len);
    }

    output_ret = mbedtls_hkdf_expand(&fake_md_info, prk, prk_len,
                                     info, info_len, okm, okm_len);
    TEST_ASSERT(output_ret == ret);

