OpenNuvoton/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
exit:
    mbedtls_free(prk);
    mbedtls_free(okm);
}

void test_test_hkdf_expand_ret_wrapper(void **params)
{

    test_test_hkdf_expand_ret(((mbedtls_test_argument_t *) params[0])->sint, ((mbedtls_test_argument_t *) params[1])->sint, ((mbedtls_test_argument_t *) params[2])->sint,
                              ((mbedtls_test_argument_t *) params[3])->sint);
}
#endif /* MBEDTLS_HKDF_C */



/*----------------------------------------------------------------------------*/
/* Test dispatch code */


/**
 * \brief       Evaluates an expression/macro into its literal integer value.
 *              For optimizing space for embedded targets each expression/macro
 *              is identified by a unique identifier instead of string literals.
 *              Identifiers and evaluation code is generated by script:
 *              generate_test_code.py
 *
 * \param exp_id    Expression identifier.
 * \param out_value Pointer to int to hold the integer.
 *
 * \return       0 if exp_id is found. 1 otherwise.
 */
int get_expression(int32_t exp_id, intmax_t *out_value)
{
    int ret = KEY_VALUE_MAPPING_FOUND;

    (void) exp_id;
    (void) out_value;

    switch (exp_id)
    {

#if defined(MBEDTLS_HKDF_C)

        case 0:
        {
            *out_value = MBEDTLS_ERR_HKDF_BAD_INPUT_DATA;
        }
        break;

        case 1:
        {
            *out_value = MBEDTLS_MD_SHA256;
        }
        break;

        case 2:
        {
            *out_value = MBEDTLS_MD_SHA1;
        }
        break;
#endif

        default:
        {
            ret = KEY_VALUE_MAPPING_NOT_FOUND;
        }
        break;
    }

    return ret;
}


/**
 * \brief       Checks if the dependency i.e. the compile flag is set.
 *              For optimizing space for embedded targets each dependency
 *              is identified by a unique identifier instead of string literals.
 *              Identifiers and check code is generated by script:
 *              generate_test_code.py
 *
 * \param dep_id    Dependency identifier.
 *
 * \return       DEPENDENCY_SUPPORTED if set else DEPENDENCY_NOT_SUPPORTED
 */
int dep_check(int dep_id)
{
    int ret = DEPENDENCY_NOT_SUPPORTED;

    (void) dep_id;

    switch (dep_id)
    {

#if defined(MBEDTLS_HKDF_C)

        case 0:
        {
#if defined(MBEDTLS_MD_CAN_SHA256)
            ret = DEPENDENCY_SUPPORTED;
#else
            ret = DEPENDENCY_NOT_SUPPORTED;
#endif
        }
        break;

        case 1:
        {
#if defined(MBEDTLS_MD_CAN_SHA1)
            ret = DEPENDENCY_SUPPORTED;
#else
            ret = DEPENDENCY_NOT_SUPPORTED;
#endif
        }
        break;
#endif


        default:
            break;
    }

    return ret;
}


/**
 * \brief       Function pointer type for test function wrappers.
 *
 * A test function wrapper decodes the parameters and passes them to the
 * underlying test function. Both the wrapper and the underlying function
 * return void. Test wrappers assume that they are passed a suitable
 * parameter array and do not perform any error detection.
 *
 * \param param_array   The array of parameters. Each element is a `void *`
 *                      which the wrapper casts to the correct type and
 *                      dereferences. Each wrapper function hard-codes the
 *                      number and types of the parameters.
 */
typedef void (*TestWrapper_t)(void **param_array);


/**
 * \brief       Table of test function wrappers. Used by dispatch_test().
 *              This table is populated by script:
 *              generate_test_code.py
 *
 */
TestWrapper_t test_funcs[] =
{
    /* Function Id: 0 */

#if defined(MBEDTLS_HKDF_C)
    test_test_hkdf_wrapper,
#else
    NULL,
#endif
    /* Function Id: 1 */

#if defined(MBEDTLS_HKDF_C)
    test_test_hkdf_extract_wrapper,
#else
    NULL,
#endif
    /* Function Id: 2 */

#if defined(MBEDTLS_HKDF_C)
    test_test_hkdf_expand_wrapper,
#else
    NULL,
#endif
    /* Function Id: 3 */

#if defined(MBEDTLS_HKDF_C)
    test_test_hkdf_extract_ret_wrapper,
#else
    NULL,
#endif
    /* Function Id: 4 */

#if defined(MBEDTLS_HKDF_C)
    test_test_hkdf_expand_ret_wrapper,
#else
    NULL,
#endif


};

/**
 * \brief        Dispatches test functions based on function index.
 *
 * \param func_idx    Test function index.
 * \param params      The array of parameters to pass to the test function.
 *                    It will be decoded by the #TestWrapper_t wrapper function.
 *
 * \return       DISPATCH_TEST_SUCCESS if found
 *               DISPATCH_TEST_FN_NOT_FOUND if not found
 *               DISPATCH_UNSUPPORTED_SUITE if not compile time enabled.
 */
int dispatch_test(size_t func_idx, void **params)
{
    int ret = DISPATCH_TEST_SUCCESS;
    TestWrapper_t fp = NULL;

    if (func_idx < (int)(sizeof(test_funcs) / sizeof(TestWrapper_t)))
    {
        fp = test_funcs[func_idx];

        if (fp)
        {
#if defined(MBEDTLS_PSA_CRYPTO_EXTERNAL_RNG)
            mbedtls_test_enable_insecure_external_rng();
#endif

            fp(params);

#if defined(MBEDTLS_TEST_MUTEX_USAGE)
            mbedtls_test_mutex_usage_check();
#endif /* MBEDTLS_TEST_MUTEX_USAGE */
        }
        else
        {
            ret = DISPATCH_UNSUPPORTED_SUITE;
            mbedtls_fprintf(stdout, "dispatch_test, DISPATCH_UNSUPPORTED_SUITE\r\n");
        }
    }
    else
    {
        ret = DISPATCH_TEST_FN_NOT_FOUND;
    }

    return ret;
}


/**
 * \brief       Checks if test function is supported in this build-time
 *              configuration.
 *
 * \param func_idx    Test function index.
 *
 * \return       DISPATCH_TEST_SUCCESS if found
 *               DISPATCH_TEST_FN_NOT_FOUND if not found
 *               DISPATCH_UNSUPPORTED_SUITE if not compile time enabled.
 */
int check_test(size_t func_idx)
{
    int ret = DISPATCH_TEST_SUCCESS;
    TestWrapper_t fp = NULL;

    if (func_idx < (int)(sizeof(test_funcs) / sizeof(TestWrapper_t)))
    {
        fp = test_funcs[func_idx];

        if (fp == NULL)
        {
            ret = DISPATCH_UNSUPPORTED_SUITE;
            mbedtls_fprintf(stdout, "check_test, DISPATCH_UNSUPPORTED_SUITE\r\n");

