OpenNuvoton/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
        if (strcmp(type, "char*") == 0)
        {
            if (verify_string(&val) == 0)
            {
                *out++ = val;
            }
            else
            {
                ret = (DISPATCH_INVALID_TEST_DATA);
                break;
            }
        }
        else if (strcmp(type, "int") == 0)
        {
            if (verify_int(val, (int32_t *)(&(int_params_store->sint))) == 0)
            {
                *out++ = (char *) int_params_store++;
            }
            else
            {
                ret = (DISPATCH_INVALID_TEST_DATA);
                break;
            }
        }
        else if (strcmp(type, "hex") == 0)
        {
            if (verify_string(&val) == 0)
            {
                size_t len;

                TEST_HELPER_ASSERT(
                    mbedtls_test_unhexify((unsigned char *) val, strlen(val),
                                          val, &len) == 0);

                int_params_store->len = len;
                *out++ = val;
                *out++ = (char *)(int_params_store++);
            }
            else
            {
                ret = (DISPATCH_INVALID_TEST_DATA);
                break;
            }
        }
        else if (strcmp(type, "exp") == 0)
        {
            int exp_id = strtol(val, NULL, 10);

            if (get_expression(exp_id, &int_params_store->sint) == 0)
            {
                *out++ = (char *) int_params_store++;
            }
            else
            {
                ret = (DISPATCH_INVALID_TEST_DATA);
                break;
            }
        }
        else
        {
            ret = (DISPATCH_INVALID_TEST_DATA);
            break;
        }
    }

    return ret;
}

/**
 * \brief       Tests snprintf implementation with test input.
 *
 * \note
 * At high optimization levels (e.g. gcc -O3), this function may be
 * inlined in run_test_snprintf. This can trigger a spurious warning about
 * potential misuse of snprintf from gcc -Wformat-truncation (observed with
 * gcc 7.2). This warning makes tests in run_test_snprintf redundant on gcc
 * only. They are still valid for other compilers. Avoid this warning by
 * forbidding inlining of this function by gcc.
 *
 * \param n         Buffer test length.
 * \param ref_buf   Expected buffer.
 * \param ref_ret   Expected snprintf return value.
 *
 * \return      0 for success else 1
 */
#if defined(__GNUC__)
    __attribute__((__noinline__))
#endif
static int test_snprintf(size_t n, const char *ref_buf, int ref_ret)
{
    int ret;
    char buf[10] = "xxxxxxxxx";
    const char ref[10] = "xxxxxxxxx";

    if (n >= sizeof(buf))
    {
        return -1;
    }

    ret = mbedtls_snprintf(buf, n, "%s", "123");

    if (ret < 0 || (size_t) ret >= n)
    {
        ret = -1;
    }

    if (strncmp(ref_buf, buf, sizeof(buf)) != 0 ||
            ref_ret != ret ||
            memcmp(buf + n, ref + n, sizeof(buf) - n) != 0)
    {
        return 1;
    }

    return 0;
}

/**
 * \brief       Tests snprintf implementation.
 *
 * \return      0 for success else 1
 */
static int run_test_snprintf(void)
{
    return test_snprintf(0, "xxxxxxxxx",  -1) != 0 ||
           test_snprintf(1, "",           -1) != 0 ||
           test_snprintf(2, "1",          -1) != 0 ||
           test_snprintf(3, "12",         -1) != 0 ||
           test_snprintf(4, "123",         3) != 0 ||
           test_snprintf(5, "123",         3) != 0;
}

/** \brief Write the description of the test case to the outcome CSV file.
 *
 * \param outcome_file  The file to write to.
 *                      If this is \c NULL, this function does nothing.
 * \param argv0         The test suite name.
 * \param test_case     The test case description.
 */
static void write_outcome_entry(FILE *outcome_file,
                                const char *argv0,
                                const char *test_case)
{
    /* The non-varying fields are initialized on first use. */
    static const char *platform = NULL;
    static const char *configuration = NULL;
    static const char *test_suite = NULL;

    if (outcome_file == NULL)
    {
        return;
    }

    if (platform == NULL)
    {
        platform = getenv("MBEDTLS_TEST_PLATFORM");

        if (platform == NULL)
        {
            platform = "unknown";
        }
    }

    if (configuration == NULL)
    {
        configuration = getenv("MBEDTLS_TEST_CONFIGURATION");

        if (configuration == NULL)
        {
            configuration = "unknown";
        }
    }

    if (test_suite == NULL)
    {
        test_suite = strrchr(argv0, '/');

        if (test_suite != NULL)
        {
            test_suite += 1; // skip the '/'
        }
        else
        {
            test_suite = argv0;
        }
    }

    /* Write the beginning of the outcome line.
     * Ignore errors: writing the outcome file is on a best-effort basis. */
    mbedtls_fprintf(outcome_file, "%s;%s;%s;%s;",
                    platform, configuration, test_suite, test_case);
}

/** \brief Write the result of the test case to the outcome CSV file.
 *
 * \param outcome_file  The file to write to.
 *                      If this is \c NULL, this function does nothing.
 * \param unmet_dep_count            The number of unmet dependencies.
 * \param unmet_dependencies         The array of unmet dependencies.
 * \param missing_unmet_dependencies Non-zero if there was a problem tracking
 *                                   all unmet dependencies, 0 otherwise.
 * \param ret                        The test dispatch status (DISPATCH_xxx).
 * \param info                       A pointer to the test info structure.
 */
static void write_outcome_result(FILE *outcome_file,
                                 size_t unmet_dep_count,
                                 int unmet_dependencies[],
                                 int missing_unmet_dependencies,
                                 int ret,
                                 const mbedtls_test_info_t *info)
{
    if (outcome_file == NULL)
    {
        return;
    }

