OpenNuvoton/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
    /* If no files were specified, assume a default */
    if (test_files == NULL || testfile_count == 0)
    {
        test_files = &default_filename;
        testfile_count = 1;
    }

    /* Initialize the struct that holds information about the last test */
    mbedtls_test_info_reset();

    /* Now begin to execute the tests in the testfiles */
    for (testfile_index = 0;
            testfile_index < testfile_count;
            testfile_index++)
    {
        size_t unmet_dep_count = 0;
        int unmet_dependencies[20];
        int missing_unmet_dependencies = 0;

        test_filename = test_files[testfile_index];

        file = myfopen(test_filename, "r");

        if (file == NULL)
        {
            mbedtls_fprintf(stderr, "Failed to open test file: %s\n",
                            test_filename);

            if (outcome_file != NULL)
            {
                myfclose(outcome_file);
            }

            return 1;
        }

        while (!myfeof(file))
        {
            if (unmet_dep_count > 0)
            {
                mbedtls_fprintf(stderr,
                                "FATAL: Dep count larger than zero at start of loop\n");
                mbedtls_exit(MBEDTLS_EXIT_FAILURE);
            }

            unmet_dep_count = 0;
            missing_unmet_dependencies = 0;

            if ((ret = get_line(file, buf, sizeof(buf))) != 0)
            {
                break;
            }

            mbedtls_fprintf(stdout, "%s%.66s",
                            mbedtls_test_info.result == MBEDTLS_TEST_RESULT_FAILED ?
                            "\n" : "", buf);
            mbedtls_fprintf(stdout, " ");

            for (i = strlen(buf) + 1; i < 67; i++)
            {
                mbedtls_fprintf(stdout, ".");
            }

            mbedtls_fprintf(stdout, " ");
            fflush(stdout);
            write_outcome_entry(outcome_file, argv[0], buf);

            total_tests++;

            if ((ret = get_line(file, buf, sizeof(buf))) != 0)
            {
                break;
            }

            cnt = parse_arguments(buf, strlen(buf), params,
                                  sizeof(params) / sizeof(params[0]));

            if (strcmp(params[0], "depends_on") == 0)
            {
                for (i = 1; i < cnt; i++)
                {
                    int dep_id = strtol(params[i], NULL, 10);

                    if (dep_check(dep_id) != DEPENDENCY_SUPPORTED)
                    {
                        if (unmet_dep_count <
                                ARRAY_LENGTH(unmet_dependencies))
                        {
                            unmet_dependencies[unmet_dep_count] = dep_id;
                            unmet_dep_count++;
                        }
                        else
                        {
                            missing_unmet_dependencies = 1;
                        }
                    }
                }

                if ((ret = get_line(file, buf, sizeof(buf))) != 0)
                {
                    break;
                }

                cnt = parse_arguments(buf, strlen(buf), params,
                                      sizeof(params) / sizeof(params[0]));
            }

            // If there are no unmet dependencies execute the test
            if (unmet_dep_count == 0)
            {
                mbedtls_test_info_reset();

#if defined(__unix__) || (defined(__APPLE__) && defined(__MACH__))

                /* Suppress all output from the library unless we're verbose
                 * mode
                 */
                if (!option_verbose)
                {
                    stdout_fd = redirect_output(stdout, "/dev/null");

                    if (stdout_fd == -1)
                    {
                        /* Redirection has failed with no stdout so exit */
                        exit(1);
                    }
                }

#endif /* __unix__ || __APPLE__ __MACH__ */

                function_id = strtoul(params[0], NULL, 10);

                if ((ret = check_test(function_id)) == DISPATCH_TEST_SUCCESS)
                {
                    ret = convert_params(cnt - 1, params + 1, (mbedtls_test_argument_t *)int_params/*Wayne: Just for pass the building.*/);

                    if (DISPATCH_TEST_SUCCESS == ret)
                    {
                        mbedtls_fprintf(stdout, "\r\nfunction_id=%d, %s \r\n ", function_id, *(params));
                        ret = dispatch_test(function_id, (void **)(params + 1));
                    }
                }

#if defined(__unix__) || (defined(__APPLE__) && defined(__MACH__))

                if (!option_verbose && restore_output(stdout, stdout_fd))
                {
                    /* Redirection has failed with no stdout so exit */
                    exit(1);
                }

#endif /* __unix__ || __APPLE__ __MACH__ */

            }

            write_outcome_result(outcome_file,
                                 unmet_dep_count, unmet_dependencies,
                                 missing_unmet_dependencies,
                                 ret, &mbedtls_test_info);

            if (unmet_dep_count > 0 || ret == DISPATCH_UNSUPPORTED_SUITE)
            {
                total_skipped++;
                //mbedtls_fprintf(stdout, "++++");
                mbedtls_fprintf(stdout, "unmet_dep_count=%d ", unmet_dep_count);
                mbedtls_fprintf(stdout, "SKIPPED\n");

                if (1 == option_verbose && ret == DISPATCH_UNSUPPORTED_SUITE)
                {
                    mbedtls_fprintf(stdout, "\n   Test Suite not enabled");
                }

                if (1 == option_verbose && unmet_dep_count > 0)
                {
                    mbedtls_fprintf(stdout, "\n   Unmet dependencies: ");

                    for (i = 0; i < unmet_dep_count; i++)
                    {
                        mbedtls_fprintf(stdout, "%d ",
                                        unmet_dependencies[i]);
                    }

                    if (missing_unmet_dependencies)
                    {
                        mbedtls_fprintf(stdout, "...");
                    }
                }

                mbedtls_fprintf(stdout, "\n");
                fflush(stdout);

                unmet_dep_count = 0;
                missing_unmet_dependencies = 0;
            }
            else if (ret == DISPATCH_TEST_SUCCESS)
            {
                if (mbedtls_test_info.result == MBEDTLS_TEST_RESULT_SUCCESS)
                {
                    mbedtls_fprintf(stdout, "PASS\n");
                }
                else if (mbedtls_test_info.result == MBEDTLS_TEST_RESULT_SKIPPED)
                {
                    mbedtls_fprintf(stdout, "SKIPPED\n");
                    total_skipped++;
                }
                else
                {
                    total_errors++;
                    mbedtls_fprintf(stdout, "FAILED\n");
                    mbedtls_fprintf(stdout, "  %s\n  at ",
                                    mbedtls_test_info.test);

                    if (mbedtls_test_info.step != (unsigned long)(-1))
                    {
                        mbedtls_fprintf(stdout, "step %lu, ",
                                        mbedtls_test_info.step);
                    }

