OpenNuvoton/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
                    mbedtls_fprintf(stdout, "line %d, %s",
                                    mbedtls_test_info.line_no,
                                    mbedtls_test_info.filename);

                    if (mbedtls_test_info.line1[0] != 0)
                    {
                        mbedtls_fprintf(stdout, "\n  %s",
                                        mbedtls_test_info.line1);
                    }

                    if (mbedtls_test_info.line2[0] != 0)
                    {
                        mbedtls_fprintf(stdout, "\n  %s",
                                        mbedtls_test_info.line2);
                    }
                }

                fflush(stdout);
            }
            else if (ret == DISPATCH_INVALID_TEST_DATA)
            {
                mbedtls_fprintf(stderr, "FAILED: FATAL PARSE ERROR\n");
                myfclose(file);
                mbedtls_exit(2);
            }
            else if (ret == DISPATCH_TEST_FN_NOT_FOUND)
            {
                mbedtls_fprintf(stderr, "FAILED: FATAL TEST FUNCTION NOT FOUND\n");
                myfclose(file);
                mbedtls_exit(2);
            }
            else
            {
                total_errors++;
            }
        }

        myfclose(file);
    }

    if (outcome_file != NULL)
    {
        myfclose(outcome_file);
    }

    mbedtls_fprintf(stdout,
                    "\n--------------------------------------------------\n\n");

    if (total_errors == 0)
    {
        mbedtls_fprintf(stdout, "PASSED");
    }
    else
    {
        mbedtls_fprintf(stdout, "FAILED");
    }

    mbedtls_fprintf(stdout, " ++++(%u passed/ %u tests (%u skipped))++++\n",
                    total_tests - total_errors, total_tests, total_skipped);

#if defined(MBEDTLS_TEST_MUTEX_USAGE)
    mbedtls_test_mutex_usage_end();
#endif

#if defined(MBEDTLS_MEMORY_BUFFER_ALLOC_C) && \
    !defined(TEST_SUITE_MEMORY_BUFFER_ALLOC)
#if defined(MBEDTLS_MEMORY_DEBUG)
    mbedtls_memory_buffer_alloc_status();
#endif
    mbedtls_memory_buffer_alloc_free();
#endif

    return total_errors != 0;
}



/*----------------------------------------------------------------------------*/
/* Main Test code */
volatile uint32_t g_u32Ticks = 0;
#ifdef NVT_HKDF_ALT
    char au8KeyIn[]   = "000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1f";//64 Octects
    char au8Salt[]    = "606162636465666768696a6b6c6d6e6f707172737475767778797a7b7c7d7e7f";//64 Octects
    char au8Info[]    = "b0b1b2b3b4b5b6b7b8b9babb00bdbebfc0c1c2c3c4c5c6c7c8c9cacbcc0100";//62 Octects
    char au8KeyOut[]  = "a8873e7992d2d5ce6a816451fd64ac39eae82814946adefe4809ec42125f3687";//64 Octects
#else//MBEDTLS_STD
    char au8KeyIn[]   = "0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b";//22 Octects
    char au8Salt[]    = "000102030405060708090a0b0c";//13 Octects
    char au8Info[]    = "f0f1f2f3f4f5f6f7f8f9";//10 Octects
    char au8KeyOut[]  = "3cb25f25faacd57a90434f64d0362f2a2d2d0a90cf1a5a4c5db02d56ecc4c5bf34007208d5b887185865";//42+6 Octects
#endif

void SYS_Init(void)
{

    /* Unlock protected registers */
    SYS_UnlockReg();

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Enable PLL0 180MHz clock from HIRC and switch SCLK clock source to PLL0 */
    CLK_SetBusClock(CLK_SCLKSEL_SCLKSEL_APLL0, CLK_APLLCTL_APLLSRC_HXT, FREQ_220MHZ);

    /* Update System Core Clock */
    /* User can use SystemCoreClockUpdate() to calculate SystemCoreClock. */
    SystemCoreClockUpdate();

    /* Enable UART0 module clock */
    CLK_EnableModuleClock(UART0_MODULE);

    /* Enable KDF related module clock */
    CLK_EnableModuleClock(KDF0_MODULE);
    CLK_EnableModuleClock(TRNG0_MODULE);
    CLK_EnableModuleClock(KS0_MODULE);

    /* Debug UART clock setting*/
    SetDebugUartCLK();

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Set PB multi-function pins for UART0 RXD and TXD */
    SetDebugUartMFP();

}


void SysTick_Handler()
{
    g_u32Ticks++;
}



/**
 * \brief       Program main. Invokes platform specific execute_tests().
 *
 * \param argc      Command line arguments count.
 * \param argv      Array of command line arguments.
 *
 * \return       Exit code.
 */
int main()
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O. */
    SYS_Init();

    /* Init Debug UART for printf */
    InitDebugUart();
    /* Lock protected registers */
    SYS_LockReg();

    SysTick_Config(SystemCoreClock / 1000);

    printf("MBEDTLS HKDF self test ...\n");

#if defined(MBEDTLS_TEST_HOOKS)
    extern void (*mbedtls_test_hook_test_fail)(const char *test, int line, const char *file);
    mbedtls_test_hook_test_fail = &mbedtls_test_fail;
#if defined(MBEDTLS_ERROR_C)
    mbedtls_test_hook_error_add = &mbedtls_test_err_add_check;
#endif
#endif

#ifdef NVT_HKDF_ALT
    printf("NVT HKDF accelerator is running.\n");
#else
    printf("mbedtls SW library HKDF is running.\n");
#endif

    printf("#define DBG_TEST_TEST_HKDF_SHA256_RESULT to see details.\n");
    SysTick_Config(SystemCoreClock / 1000);

    g_u32Ticks = 0;


#ifdef NVT_HKDF_ALT
    data_t nvt_ikm  = {.x = (uint8_t *) &au8KeyIn[0],  .len = strlen(au8KeyIn) / 2 };
    data_t nvt_salt = {.x = (uint8_t *) &au8Salt[0],   .len = strlen(au8Salt) / 2};
    data_t nvt_info = {.x = (uint8_t *) &au8Info[0],   .len = strlen(au8Info) / 2};
    data_t nvt_okm  = {.x = (uint8_t *) &au8KeyOut[0], .len = strlen(au8KeyOut) / 2 };
#else//MBEDTLS_STD
    data_t nvt_ikm = {.x = (uint8_t *) &au8KeyIn[0], .len = 22 };
    data_t nvt_salt = {.x = (uint8_t *) &au8Salt[0], .len = 13 };
    data_t nvt_info = {.x = (uint8_t *) &au8Info[0], .len = 10 };
    data_t nvt_okm = {.x = (uint8_t *) &au8KeyOut[0], .len = 42};

#endif
    test_test_hkdf_sha256(&nvt_ikm,  &nvt_salt, &nvt_info, &nvt_okm);

    printf("Total elapsed time is %d ms\n", g_u32Ticks);

    for (;;) {}
}
